/********************************************************************************
 * Copyright (c) 2024 Kopernikus Automotive
 * 
 * This program and the accompanying materials are made available under the
 * terms of the Apache License, Version 2.0 which is available at
 * https://www.apache.org/licenses/LICENSE-2.0.
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the
 * License for the specific language governing permissions and limitations
 * under the License.
 * 
 * SPDX-License-Identifier: Apache-2.0
 ********************************************************************************/
 
#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
#![allow(non_snake_case)]
/* automatically generated by rust-bindgen */

pub const ECAL_ALLOCATE_4ME: u32 = 0;
pub const ECAL_VERSION_MAJOR: u32 = 5;
pub const ECAL_VERSION_MINOR: u32 = 5;
pub const ECAL_VERSION_PATCH: u32 = 5;
pub const ECAL_VERSION: &[u8; 18usize] = b"v5.5.5-3-gb779f09\0";
pub const ECAL_DATE: &[u8; 11usize] = b"07.05.2020\0";
pub const ECAL_PLATFORMTOOLSET: &[u8; 1usize] = b"\0";
pub const eCAL_Init_Publisher: u32 = 1;
pub const eCAL_Init_Subscriber: u32 = 2;
pub const eCAL_Init_Service: u32 = 4;
pub const eCAL_Init_Monitoring: u32 = 8;
pub const eCAL_Init_Logging: u32 = 16;
pub const eCAL_Init_TimeSync: u32 = 32;

    #[doc = " @return  None zero if succeeded."]
    pub fn eCAL_Timer_Stop(handle_: ECAL_HANDLE) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Send shutdown event to specified local user process using it's unit name."]
    #[doc = ""]
    #[doc = " @param unit_name_  Process unit name."]
    pub fn eCAL_Util_ShutdownUnitName(unit_name_: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " @brief Send shutdown event to specified local user process using it's process id."]
    #[doc = ""]
    #[doc = " @param process_id_  Process id."]
    pub fn eCAL_Util_ShutdownProcessID(process_id_: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " @brief Send shutdown event to all local user processes."]
    pub fn eCAL_Util_ShutdownProcesses();
}
extern "C" {
    #[doc = " @brief Send shutdown event to all local core components."]
    pub fn eCAL_Util_ShutdownCore();
}
extern "C" {
    #[doc = " @brief Enable eCAL message loop back,"]
    #[doc = "          that means subscriber will receive messages from"]
    #[doc = "          publishers of the same process (default == false)."]
    #[doc = ""]
    #[doc = " @param state_  Switch on message loop back.."]
    pub fn eCAL_Util_EnableLoopback(state_: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " @brief Gets type name of the specified topic."]
    #[doc = ""]
    #[doc = " @param       topic_name_      Topic name."]
    #[doc = " @param [out] topic_type_      Pointer to store the type name information."]
    #[doc = " @param       topic_type_len_  Length of allocated buffer or ECAL_ALLOCATE_4ME if"]
    #[doc = "                               eCAL should allocate the buffer for you (see eCAL_FreeMem)."]
    #[doc = ""]
    #[doc = " @return  Type name buffer length or zero if failed."]
    pub fn eCAL_Util_GetTypeName(
        topic_name_: *const ::std::os::raw::c_char,
        topic_type_: *mut ::std::os::raw::c_void,
        topic_type_len_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Gets type description of the specified topic."]
    #[doc = ""]
    #[doc = " @param       topic_name_      Topic name."]
    #[doc = " @param [out] topic_desc_      Pointer to store the type description information."]
    #[doc = " @param       topic_desc_len_  Length of allocated buffer or ECAL_ALLOCATE_4ME if"]
    #[doc = "                               eCAL should allocate the buffer for you (see eCAL_FreeMem)."]
    #[doc = ""]
    #[doc = " @return  Type description buffer length or zero if failed."]
    pub fn eCAL_Util_GetDescription(
        topic_name_: *const ::std::os::raw::c_char,
        topic_desc_: *mut ::std::os::raw::c_void,
        topic_desc_len_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}


#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    fn bindgen_test_layout_SReceiveCallbackDataC() {
        assert_eq!(
            ::std::mem::size_of::<SReceiveCallbackDataC>(),
            40usize,
            concat!("Size of: ", stringify!(SReceiveCallbackDataC))
        );
        assert_eq!(
            ::std::mem::align_of::<SReceiveCallbackDataC>(),
            8usize,
            concat!("Alignment of ", stringify!(SReceiveCallbackDataC))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReceiveCallbackDataC>())).buf as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SReceiveCallbackDataC),
                "::",
                stringify!(buf)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReceiveCallbackDataC>())).size as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SReceiveCallbackDataC),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReceiveCallbackDataC>())).id as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SReceiveCallbackDataC),
                "::",
                stringify!(id)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReceiveCallbackDataC>())).time as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(SReceiveCallbackDataC),
                "::",
                stringify!(time)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReceiveCallbackDataC>())).clock as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(SReceiveCallbackDataC),
                "::",
                stringify!(clock)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_SServiceInfoC() {
        assert_eq!(
            ::std::mem::size_of::<SServiceInfoC>(),
            40usize,
            concat!("Size of: ", stringify!(SServiceInfoC))
        );
        assert_eq!(
            ::std::mem::align_of::<SServiceInfoC>(),
            8usize,
            concat!("Alignment of ", stringify!(SServiceInfoC))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SServiceInfoC>())).host_name as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SServiceInfoC),
                "::",
                stringify!(host_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SServiceInfoC>())).service_name as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SServiceInfoC),
                "::",
                stringify!(service_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SServiceInfoC>())).method_name as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SServiceInfoC),
                "::",
                stringify!(method_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SServiceInfoC>())).error_msg as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(SServiceInfoC),
                "::",
                stringify!(error_msg)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SServiceInfoC>())).ret_state as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(SServiceInfoC),
                "::",
                stringify!(ret_state)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SServiceInfoC>())).call_state as *const _ as usize },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(SServiceInfoC),
                "::",
                stringify!(call_state)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_SReaderQOSC() {
        assert_eq!(
            ::std::mem::size_of::<SReaderQOSC>(),
            12usize,
            concat!("Size of: ", stringify!(SReaderQOSC))
        );
        assert_eq!(
            ::std::mem::align_of::<SReaderQOSC>(),
            4usize,
            concat!("Alignment of ", stringify!(SReaderQOSC))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReaderQOSC>())).history_kind as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SReaderQOSC),
                "::",
                stringify!(history_kind)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReaderQOSC>())).history_kind_depth as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SReaderQOSC),
                "::",
                stringify!(history_kind_depth)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SReaderQOSC>())).reliability as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SReaderQOSC),
                "::",
                stringify!(reliability)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_SWriterQOSC() {
        assert_eq!(
            ::std::mem::size_of::<SWriterQOSC>(),
            12usize,
            concat!("Size of: ", stringify!(SWriterQOSC))
        );
        assert_eq!(
            ::std::mem::align_of::<SWriterQOSC>(),
            4usize,
            concat!("Alignment of ", stringify!(SWriterQOSC))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SWriterQOSC>())).history_kind as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SWriterQOSC),
                "::",
                stringify!(history_kind)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SWriterQOSC>())).history_kind_depth as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SWriterQOSC),
                "::",
                stringify!(history_kind_depth)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SWriterQOSC>())).reliability as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SWriterQOSC),
                "::",
                stringify!(reliability)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_SSubEventCallbackDataC() {
        assert_eq!(
            ::std::mem::size_of::<SSubEventCallbackDataC>(),
            24usize,
            concat!("Size of: ", stringify!(SSubEventCallbackDataC))
        );
        assert_eq!(
            ::std::mem::align_of::<SSubEventCallbackDataC>(),
            8usize,
            concat!("Alignment of ", stringify!(SSubEventCallbackDataC))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SSubEventCallbackDataC>())).type_ as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SSubEventCallbackDataC),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SSubEventCallbackDataC>())).time as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SSubEventCallbackDataC),
                "::",
                stringify!(time)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SSubEventCallbackDataC>())).clock as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SSubEventCallbackDataC),
                "::",
                stringify!(clock)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_SPubEventCallbackDataC() {
        assert_eq!(
            ::std::mem::size_of::<SPubEventCallbackDataC>(),
            24usize,
            concat!("Size of: ", stringify!(SPubEventCallbackDataC))
        );
        assert_eq!(
            ::std::mem::align_of::<SPubEventCallbackDataC>(),
            8usize,
            concat!("Alignment of ", stringify!(SPubEventCallbackDataC))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SPubEventCallbackDataC>())).type_ as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SPubEventCallbackDataC),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SPubEventCallbackDataC>())).time as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SPubEventCallbackDataC),
                "::",
                stringify!(time)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SPubEventCallbackDataC>())).clock as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SPubEventCallbackDataC),
                "::",
                stringify!(clock)
            )
        );
    }
}
